from .. import app
from flask import render_template


directions = [
    {
        "short_description": "Zaporizhzhia is known for the historic island of Khortytsia, multiple power stations and for being an important industrial centre",
        "long_description": """Запорі́жжя (МФА: [zɑpoˈriʒʲːɐ] ( прослухати); до 1921 року — Олекса́ндрівськ) — місто в Україні, адміністративний центр Запорізької області. За чисельністю населення — 6-те місто країни (710 052 осіб станом на 1 січня 2022 року)[4]. Розташоване на головній воднотранспортній магістралі України — річці Дніпро, у місці її перетину транспортно-комунікаційними коридорами, що сполучають Південь України з її столицею, західними, центральними областями та Донбас із Криворіжжям.

Разом із навколишніми поселеннями утворює Запорізьку агломерацію. Є одним з найбільших адміністративних, індустріальних та культурних центрів Півдня України з розвиненим машинобудуванням, чорною та кольоровою металургією, хімічною та будівельною промисловістю, річковим портом і важливим транзитним залізничним вузлом.

Відповідно до Зведеної схеми районного планування України, Запоріжжя займає важливе місце в регіональній системі розселення і виконує функції обласного, міжнародного і районного центрів, кожний з яких має свою зону міжселищного обслуговування. Отож, у зоні впливу Запоріжжя як обласного центра на території 2690 тис. га розташовано 14 міст, 23 селища, значна кількість сіл, в яких мешкає понад 2 млн осіб. Очолювана Запоріжжям міжрайонна система розселення (приміська зона), вирізняється високим рівнем виробничо-господарського опанування території, високою цінністю сільськогосподарських земель і середовища.

Приміська зона охоплює Запорізький, Василівський та Пологівський район (у тому числі до 17 липня 2020 року — ліквідовані колишні Вільнянський, Новомиколаївський, Оріхівський, Кам'янсько-Дніпровський адміністративні райони Запорізької області), загальна площа яких становить 760 тис. га. Тут розташовано 5 міст, 6 селищ та приблизно 300 сільських населених пунктів. Загальна чисельність населення приміської зони становить приблизно 315 тис. осіб.

Особливістю міста Запоріжжя є те, що в ньому зосереджено приблизно 65 % продуктивних потужностей області й 43 % населення області.

З 24 лютого 2022 року, в ході російського вторгнення в Україну, російські окупанти регулярно завдають обстріли по інфраструктурі та житловим будівлям міста Запоріжжя.

7 серпня 2023 року на сайті Президента України зареєстрована петиція про присвоєння місту почесної відзнаки «Місто-герой України»[7].""",
        "amount": 15,
        "title": "Запоріжжя",
        "logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/%D0%9D%D1%96%D1%87%D0%BD%D0%B8%D0%B9_%D0%BF%D1%80%D0%BE%D1%81%D0%BF%D0%B5%D0%BA%D1%82.jpg/265px-%D0%9D%D1%96%D1%87%D0%BD%D0%B8%D0%B9_%D0%BF%D1%80%D0%BE%D1%81%D0%BF%D0%B5%D0%BA%D1%82.jpg",
    }
]


@app.get("/directions")
def direction_list():
    return render_template("index.html", title="Directions", directions=directions)


@app.get("/directions/<int:id>")
def direction_item(id: int):
    direction = directions[id]
    return render_template("detail.html", title=direction.get("title"), item=direction)
